Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/index.html.txt.tmx
Source language: en
Languages: ga

source: There are important rules about the content of the summons and how this document is served on you
ga: Tá cur síos anseo ar thoghairmeacha

source: Legal representation in criminal cases
ga: Ionadaíocht Dhleathach i gcás Coiriúil

source: Types of criminal offence and the role of your defence counsel in a criminal case in Ireland are described
ga: Déantar cur síos anseo ar ionadaíocht dlhleathach i gcásanna coiriúla

source: Time limitations for the commencement of criminal proceedings
ga: Teorainneacha ama chun imeachtaí coiriúla a thosú

source: Information on the time limits for the commencement of criminal proceedings in Ireland is provided
ga: Tá cur síos anseo ar na téarmaí ama le tús a chur le cás coiriúil

source: An introduction to the various types of criminal trial that take place in Ireland
ga: Déantar cur síos anseo ar an triail choiriúil agus cuirtear an rannóg seo i láthair

source: Disclosure in criminal cases
ga: Nochtadh i gcásanna coiriúla

source: In a criminal trial the prosecution has a duty to disclose to the defence, in advance of the trial, all relevant evidence which it has
ga: I dtriail choiriúil tá sé de dhualgas ag lucht an ionchúisimh an fhianaise ábhartha go léir atá acu a nochtadh don lucht cosanta roimh an triail

source: However, this duty can vary
ga: Ach d'fhéadfadh an dualgas sin bheith éagsúil

source: Criminal insanity and mental health
ga: Gealtacht choiriúil agus meabhairshláinte

source: The law regarding criminal insanity and mental health sets out rules on fitness to plead, diminished responsibility and the Mental Health Review Board
ga: Leagann an dlí maidir le gealtacht choiriúil agus sláinte mheabhrach amach rialacha maidir le folláine a phléadáil, freagracht laghdaithe agus an Bord Athbhreithnithe Meabhair-Shláinte

source: Sentencing at criminal trials in Ireland
ga: Gearradh pionóis ag trialacha coiriúla in Éirinn

source: Where a court in Ireland has found you guilty of an offence or you have pleaded guilty, the judge will decide on your sentence
ga: Tá cur síos anseo ar na rialacha a bhaineann le breith a thabhairt ar choirpigh ciontaithe

source: There are a range of sentences available to judges that can be imposed on someone found guilty of a criminal offence
ga: Tá réimse leathan de phianbhreitheanna ar fáil do bhreithiúna ar féidir a ghearradh ar dhuine a fhaightear ciontach i gcion coiriúil

source: Maximum fines on summary conviction
ga: Fíneálacha uasta ar ciontú achomair

source: There are 5 classes of maximum fine applying to summary convictions
ga: Is ann do 5 aicme d’fhineáil uasta a bhaineann le ciontuithe achomair

source: Judges in courts in Ireland have the discretion to order offenders to make a donation to the Court Poor Box (i.e., make a donation to a charity in lieu of conviction)
ga: Tá an chumhacht ag breithimh i gcúirteanna in Éirinn ordú a thabhairt do chiontóirí síntiús a dhéanamh do Bhosca na mBocht (is é sin, síntiús chuig carthanas a dhéanamh in áit a bheith ciontaithe)

source: The Drug Offenders Register was introduced by the Criminal Justice Act 2006 and is based on the same principle as the Sex Offenders Register
ga: Tugadh Clár na gCiontóirí Drugaí isteach leis an Acht um Cheartas Coiriúil 2006 agus tá sé bunaithe ar an bprionsabal céanna le Clár na gCiontóirí Gnéis

source: It enables the movements of convicted drug dealers to be recorded
ga: Cuireann sé ar chumas na hÚdaráis gluaiseachtaí ciontaithe gáinneálaithe drugaí a thaifeadadh

source: Those who are convicted of certain sexual offences are obliged to provide certain information to the Gardaí including the address at which they are living following their release from prison
ga: Tá oibleagáid ar dhaoine a chiontaítear as cionta áirithe gnéis faisnéis áirithe a chur ar fáil do na Gardaí, lena n-áirítear an seoladh ina mbeidh siad ina gcónaí i ndiaidh a scaoilte saor ón phríosún

source: This provision was introduced by the Sex Offenders Act 2001
ga: Tugadh an fhoráil seo isteach leis an Acht um Chiontóirí Gnéis 2001

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
